# Loandefault analysis

In [89]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib notebook

In [90]:
df = pd.read_csv('../data/train.csv')
df.head()

,Unnamed: 0,minority,sex,ZIP,rent,education,age,income,loan_size,payment_timing,year,job_stability,default,occupation
0,0,1,0,MT04PA,1,57.230650,36.050927,205168.022244,7600.292199,3.302193,0,3.015554,True,MZ10CD
1,1,1,0,MT04PA,1,45.891343,59.525251,187530.409981,5534.271289,3.843058,0,5.938132,True,MZ10CD
2,2,1,0,MT04PA,1,46.775489,67.338108,196912.006690,2009.903438,2.059034,0,2.190777,True,MZ10CD
3,3,1,0,MT04PA,1,41.784839,24.067401,132911.650615,3112.280893,3.936169,0,1.725860,True,MZ10CD
4,4,1,0,MT04PA,1,41.744838,47.496605,161162.551205,1372.077093,3.709910,0,0.883104,True,MZ10CD

In [91]:
df = df.drop('Unnamed: 0', axis=1)
df.head()

,minority,sex,ZIP,rent,education,age,income,loan_size,payment_timing,year,job_stability,default,occupation
0,1,0,MT04PA,1,57.230650,36.050927,205168.022244,7600.292199,3.302193,0,3.015554,True,MZ10CD
1,1,0,MT04PA,1,45.891343,59.525251,187530.409981,5534.271289,3.843058,0,5.938132,True,MZ10CD
2,1,0,MT04PA,1,46.775489,67.338108,196912.006690,2009.903438,2.059034,0,2.190777,True,MZ10CD
3,1,0,MT04PA,1,41.784839,24.067401,132911.650615,3112.280893,3.936169,0,1.725860,True,MZ10CD
4,1,0,MT04PA,1,41.744838,47.496605,161162.551205,1372.077093,3.709910,0,0.883104,True,MZ10CD

In [92]:
zip_code = pd.get_dummies(df['ZIP'])
df = pd.concat([df, zip_code], axis=1)
df = df.drop('ZIP', axis=1)
df = df.rename(columns={'MT01RA': 'zip0', 'MT04PA': 'zip1', 'MT12RA': 'zip2', 'MT15PA': 'zip3'})
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,year,job_stability,default,occupation,zip0,zip1,zip2,zip3
0,1,0,1,57.230650,36.050927,205168.022244,7600.292199,3.302193,0,3.015554,True,MZ10CD,0,1,0,0
1,1,0,1,45.891343,59.525251,187530.409981,5534.271289,3.843058,0,5.938132,True,MZ10CD,0,1,0,0
2,1,0,1,46.775489,67.338108,196912.006690,2009.903438,2.059034,0,2.190777,True,MZ10CD,0,1,0,0
3,1,0,1,41.784839,24.067401,132911.650615,3112.280893,3.936169,0,1.725860,True,MZ10CD,0,1,0,0
4,1,0,1,41.744838,47.496605,161162.551205,1372.077093,3.709910,0,0.883104,True,MZ10CD,0,1,0,0

In [93]:
occup = pd.get_dummies(df['occupation'])
df = pd.concat([df, occup], axis=1)
df = df.drop('occupation', axis=1)
df = df.rename(columns={'MZ01CD': 'occupation0', 'MZ10CD': 'occupation1', 'MZ11CD': 'occupation2'})
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,year,job_stability,default,zip0,zip1,zip2,zip3,occupation0,occupation1,occupation2
0,1,0,1,57.230650,36.050927,205168.022244,7600.292199,3.302193,0,3.015554,True,0,1,0,0,0,1,0
1,1,0,1,45.891343,59.525251,187530.409981,5534.271289,3.843058,0,5.938132,True,0,1,0,0,0,1,0
2,1,0,1,46.775489,67.338108,196912.006690,2009.903438,2.059034,0,2.190777,True,0,1,0,0,0,1,0
3,1,0,1,41.784839,24.067401,132911.650615,3112.280893,3.936169,0,1.725860,True,0,1,0,0,0,1,0
4,1,0,1,41.744838,47.496605,161162.551205,1372.077093,3.709910,0,0.883104,True,0,1,0,0,0,1,0

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480000 entries, 0 to 479999
Data columns (total 18 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   minority        480000 non-null  int64
 1   sex             480000 non-null  int64
 2   rent            480000 non-null  int64
 3   education       480000 non-null  float64
 4   age             480000 non-null  float64
 5   income          480000 non-null  float64
 6   loan_size       480000 non-null  float64
 7   payment_timing  480000 non-null  float64
 8   year            480000 non-null  int64
 9   job_stability   480000 non-null  float64
 10  default         480000 non-null  bool
 11  zip0            480000 non-null  uint8
 12  zip1            480000 non-null  uint8
 13  zip2            480000 non-null  uint8
 14  zip3            480000 non-null  uint8
 15  occupation0     480000 non-null  uint8
 16  occupation1     480000 non-null  uint8
 17  occupation2     480000 non-null  uint8
dtypes: bool(1), float64(6), int64(4), uint8(7)
memory usage: 40.3 MB

In [95]:
df['target'] = df['default'].astype(int)
df = df.drop('default', axis=1)
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,year,job_stability,zip0,zip1,zip2,zip3,occupation0,occupation1,occupation2,target
0,1,0,1,57.230650,36.050927,205168.022244,7600.292199,3.302193,0,3.015554,0,1,0,0,0,1,0,1
1,1,0,1,45.891343,59.525251,187530.409981,5534.271289,3.843058,0,5.938132,0,1,0,0,0,1,0,1
2,1,0,1,46.775489,67.338108,196912.006690,2009.903438,2.059034,0,2.190777,0,1,0,0,0,1,0,1
3,1,0,1,41.784839,24.067401,132911.650615,3112.280893,3.936169,0,1.725860,0,1,0,0,0,1,0,1
4,1,0,1,41.744838,47.496605,161162.551205,1372.077093,3.709910,0,0.883104,0,1,0,0,0,1,0,1

## test dataset

In [96]:
df = pd.read_csv('../data/test.csv')
df.head()

,Unnamed: 0.1,Unnamed: 0,minority,sex,ZIP,rent,education,age,income,loan_size,payment_timing,job_stability,year,default,occupation
0,0,0,1,0,MT04PA,1,51.265723,25.710781,166455.209729,8064.951996,3.874735,43.764963,30,True,MZ10CD
1,1,1,0,0,MT04PA,0,58.882849,39.689510,216752.885725,7166.701945,3.809001,46.903977,30,False,MZ01CD
2,2,2,0,0,MT04PA,0,56.504545,25.847324,183764.480788,3322.045258,3.497214,63.453467,30,False,MZ01CD
3,3,3,1,0,MT04PA,1,47.074111,26.381109,154057.004978,15.223904,3.535370,56.243840,30,False,MZ10CD
4,4,4,1,0,MT04PA,1,48.916960,18.779902,143463.038107,7860.534547,3.663330,49.884194,30,False,MZ10CD

In [97]:
df = df.drop('Unnamed: 0', axis=1)
df = df.drop('Unnamed: 0.1', axis=1)
df.head()

,minority,sex,ZIP,rent,education,age,income,loan_size,payment_timing,job_stability,year,default,occupation
0,1,0,MT04PA,1,51.265723,25.710781,166455.209729,8064.951996,3.874735,43.764963,30,True,MZ10CD
1,0,0,MT04PA,0,58.882849,39.689510,216752.885725,7166.701945,3.809001,46.903977,30,False,MZ01CD
2,0,0,MT04PA,0,56.504545,25.847324,183764.480788,3322.045258,3.497214,63.453467,30,False,MZ01CD
3,1,0,MT04PA,1,47.074111,26.381109,154057.004978,15.223904,3.535370,56.243840,30,False,MZ10CD
4,1,0,MT04PA,1,48.916960,18.779902,143463.038107,7860.534547,3.663330,49.884194,30,False,MZ10CD

In [98]:
zip_code = pd.get_dummies(df['ZIP'])
df = pd.concat([df, zip_code], axis=1)
df = df.drop('ZIP', axis=1)
df = df.rename(columns={'MT01RA': 'zip0', 'MT04PA': 'zip1', 'MT12RA': 'zip2', 'MT15PA': 'zip3'})
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,job_stability,year,default,occupation,zip0,zip1,zip2,zip3
0,1,0,1,51.265723,25.710781,166455.209729,8064.951996,3.874735,43.764963,30,True,MZ10CD,0,1,0,0
1,0,0,0,58.882849,39.689510,216752.885725,7166.701945,3.809001,46.903977,30,False,MZ01CD,0,1,0,0
2,0,0,0,56.504545,25.847324,183764.480788,3322.045258,3.497214,63.453467,30,False,MZ01CD,0,1,0,0
3,1,0,1,47.074111,26.381109,154057.004978,15.223904,3.535370,56.243840,30,False,MZ10CD,0,1,0,0
4,1,0,1,48.916960,18.779902,143463.038107,7860.534547,3.663330,49.884194,30,False,MZ10CD,0,1,0,0

In [99]:
occup = pd.get_dummies(df['occupation'])
df = pd.concat([df, occup], axis=1)
df = df.drop('occupation', axis=1)
df = df.rename(columns={'MZ01CD': 'occupation0', 'MZ10CD': 'occupation1', 'MZ11CD': 'occupation2'})
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,job_stability,year,default,zip0,zip1,zip2,zip3,occupation0,occupation1,occupation2
0,1,0,1,51.265723,25.710781,166455.209729,8064.951996,3.874735,43.764963,30,True,0,1,0,0,0,1,0
1,0,0,0,58.882849,39.689510,216752.885725,7166.701945,3.809001,46.903977,30,False,0,1,0,0,1,0,0
2,0,0,0,56.504545,25.847324,183764.480788,3322.045258,3.497214,63.453467,30,False,0,1,0,0,1,0,0
3,1,0,1,47.074111,26.381109,154057.004978,15.223904,3.535370,56.243840,30,False,0,1,0,0,0,1,0
4,1,0,1,48.916960,18.779902,143463.038107,7860.534547,3.663330,49.884194,30,False,0,1,0,0,0,1,0

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160000 entries, 0 to 159999
Data columns (total 18 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   minority        160000 non-null  int64
 1   sex             160000 non-null  int64
 2   rent            160000 non-null  int64
 3   education       160000 non-null  float64
 4   age             160000 non-null  float64
 5   income          160000 non-null  float64
 6   loan_size       160000 non-null  float64
 7   payment_timing  160000 non-null  float64
 8   job_stability   160000 non-null  float64
 9   year            160000 non-null  int64
 10  default         160000 non-null  bool
 11  zip0            160000 non-null  uint8
 12  zip1            160000 non-null  uint8
 13  zip2            160000 non-null  uint8
 14  zip3            160000 non-null  uint8
 15  occupation0     160000 non-null  uint8
 16  occupation1     160000 non-null  uint8
 17  occupation2     160000 non-null  uint8
dtypes: bool(1), float64(6), int64(4), uint8(7)
memory usage: 13.4 MB

In [101]:
df['target'] = df['default'].astype(int)
df = df.drop('default', axis=1)
df.head()

,minority,sex,rent,education,age,income,loan_size,payment_timing,job_stability,year,zip0,zip1,zip2,zip3,occupation0,occupation1,occupation2,target
0,1,0,1,51.265723,25.710781,166455.209729,8064.951996,3.874735,43.764963,30,0,1,0,0,0,1,0,1
1,0,0,0,58.882849,39.689510,216752.885725,7166.701945,3.809001,46.903977,30,0,1,0,0,1,0,0,0
2,0,0,0,56.504545,25.847324,183764.480788,3322.045258,3.497214,63.453467,30,0,1,0,0,1,0,0,0
3,1,0,1,47.074111,26.381109,154057.004978,15.223904,3.535370,56.243840,30,0,1,0,0,0,1,0,0
4,1,0,1,48.916960,18.779902,143463.038107,7860.534547,3.663330,49.884194,30,0,1,0,0,0,1,0,0